Assign3/JobSystem/app/views/work_orders/_form.html.erb

	  <%= f.label :worker %>
	  <%= f.select :worker_id, Worker.all.map {|worker| [worker.first_name, worker.id]} %>
---
SELECT "workers".* FROM "workers"