Assign3/JobSystem/app/views/work_orders/_list_orders.html.erb

      <tr>
		<td><%= work_order.worker.first_name %> <%= work_order.worker.last_name %></td>
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? ORDER BY "workers"."id" ASC LIMIT 1  [["id", 1]]