project/MyFacultyWebsite/app/controllers/degrees_controller.rb

INSERT INTO "degrees" ("created_at", "faculty_member_id", "field_of_study", "institution", "issue_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @degree = Degree.new(degree_params)
    @degree.faculty_member_id = current_faculty.id unless current_faculty.nil?

    if @degree.save

SELECT "degrees".* FROM "degrees" WHERE "degrees"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_degree
      @degree = Degree.find(params[:id])