project/MyFacultyWebsite/app/controllers/researches_controller.rb

  def create
    @research = Research.new(research_params)
    @research.faculty_member_id = current_faculty.id unless current_faculty.nil?

    if @research.save
---
INSERT INTO "researches" ("created_at", "end_date", "faculty_member_id", "start_date", "summary", "topic", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @research.update(research_params)
---
UPDATE "researches" SET "topic" = ?, "updated_at" = ? WHERE "researches"."id" = 1  [["topic", "v"], ["updated_at", Thu, 08 Aug 2013 18:49:50 UTC +00:00]]

  def destroy
    @research.destroy
---
DELETE FROM "researches" WHERE "researches"."id" = ?  [["id", 4]]

    def set_research
      @research = Research.find(params[:id])
---
SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "4"]]