Assign3/JobSystem/app/views/search/search_results.html.erb

	      <tr>
			<td><%= work_order.worker.first_name %> <%= work_order.worker.last_name %></td>
---
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? ORDER BY "workers"."id" ASC LIMIT 1  [["id", 1]]