Assign3/JobSystem/app/views/workers/show.html.erb

  <tbody>
    <% @worker.work_orders.each do |worker| %>
      <tr>
  		<td><%= worker.worker.first_name %> <%= worker.worker.last_name %></td>
---
SELECT "work_orders".* FROM "work_orders" WHERE "work_orders"."worker_id" = ?  [["worker_id", 1]]
SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? ORDER BY "workers"."id" ASC LIMIT 1  [["id", 1]]