Assign3/JobSystem/app/controllers/search_controller.rb

  def search_results
    @work_orders = WorkOrder.where("status = ?", params[:search])
---
SELECT "work_orders".* FROM "work_orders" WHERE (status = 'created')