Assign3/JobSystem/app/controllers/work_orders_controller.rb

SELECT "work_orders".* FROM "work_orders"
---
  def index
    @work_order = WorkOrder.new
    @work_orders = WorkOrder.all

INSERT INTO "work_orders" ("created_at", "details", "status", "updated_at", "worker_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 31 Jul 2013 00:08:29 UTC +00:00], ["details", "This is a new Work Order"], ["status", "created"], ["updated_at", Wed, 31 Jul 2013 00:08:29 UTC +00:00], ["worker_id", 1]]
SELECT "work_orders".* FROM "work_orders"
---
  def create
    @work_order = WorkOrder.new(work_order_params)
    if @work_order.save
      @work_orders = WorkOrder.all

DELETE FROM "work_orders" WHERE "work_orders"."id" = ?  [["id", 13]]
---
  def destroy
    @work_order.destroy

SELECT "work_orders".* FROM "work_orders" WHERE "work_orders"."id" = ? LIMIT 1  [["id", "13"]]
---
    def set_work_order
      @work_order = WorkOrder.find(params[:id])