Assign3/JobSystem/app/controllers/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @worker = Worker.new
    @workers = Worker.all

INSERT INTO "workers" ("created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 31 Jul 2013 00:06:13 UTC +00:00], ["first_name", "Chris"], ["last_name", "Cruz"], ["updated_at", Wed, 31 Jul 2013 00:06:13 UTC +00:00]]
SELECT "workers".* FROM "workers"
---
  def create
    @worker = Worker.new(worker_params)
    if @worker.save
      @workers = Worker.all

UPDATE "workers" SET "last_name" = ?, "first_name" = ?, "updated_at" = ? WHERE "workers"."id" = 1  [["last_name", "NewLast"], ["first_name", "NewFirst"], ["updated_at", Tue, 30 Jul 2013 20:52:50 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @worker.update(worker_params)

DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 1]]
---
  def destroy
    @worker.destroy

SELECT "workers".* FROM "workers" WHERE "workers"."id" = ? ORDER BY "workers"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_worker
      @worker = Worker.find(params[:id])